tests/fixtures/response3.xml

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
    <soapenv:Body>
        <BG:npsLa01 xmlns:BG="http://www.egem.nl/StUF/sector/bg/0310" xmlns:StUF="http://www.egem.nl/StUF/StUF0301"
                    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <BG:stuurgegevens>
                <StUF:berichtcode>La01</StUF:berichtcode>
                <StUF:zender>
                    <StUF:organisatie>Amsterdam</StUF:organisatie>
                    <StUF:applicatie>applicationName</StUF:applicatie>
                </StUF:zender>
                <StUF:ontvanger>
                    <StUF:applicatie>applicationName</StUF:applicatie>
                    <StUF:gebruiker>userName</StUF:gebruiker>
                </StUF:ontvanger>
                <StUF:referentienummer>mk3</StUF:referentienummer>
                <StUF:tijdstipBericht>2019021913181567</StUF:tijdstipBericht>
                <StUF:crossRefnummer>MijnAmsterdam||3</StUF:crossRefnummer>
                <StUF:entiteittype>NPS</StUF:entiteittype>
            </BG:stuurgegevens>
            <BG:parameters>
                <StUF:indicatorVervolgvraag>false</StUF:indicatorVervolgvraag>
            </BG:parameters>
            <BG:antwoord>
                <BG:object StUF:entiteittype="NPS" StUF:sleutelVerzendend="10042310511157"
                           StUF:sleutelGegevensbeheer="10042310511157">
                    <BG:inp.bsn>345678901</BG:inp.bsn>
                    <BG:sub.typering xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:inp.a-nummer>1111</BG:inp.a-nummer>
                    <BG:geslachtsnaam>Repelsteeltje</BG:geslachtsnaam>
                    <BG:voorvoegselGeslachtsnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:voorletters>H.</BG:voorletters>
                    <BG:voornamen>Hendrika Johanna Theodora</BG:voornamen>
                    <BG:aanduidingNaamgebruik xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:geslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:voorvoegselGeslachtsnaamPartner xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:aanhefAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:voornamenAanschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:geslachtsnaamAanschrijving xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:adellijkeTitelPredikaat xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:geslachtsaanduiding>V</BG:geslachtsaanduiding>
                    <BG:geboortedatum>19710101</BG:geboortedatum>
                    <BG:inp.geboorteplaats xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.geboorteLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:overlijdensdatum xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.overlijdenplaats xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.overlijdenLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.verblijftIn StUF:entiteittype="NPSTGO" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:verblijfsadres>
                        <BG:aoa.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:wpl.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.woonplaatsWaarinGelegen>
                            <BG:wpl.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                            <BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        </BG:aoa.woonplaatsWaarinGelegen>
                        <BG:gor.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:opr.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:gor.straatnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.postcode xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.huisnummer xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:inp.locatiebeschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:begindatumVerblijf xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    </BG:verblijfsadres>
                    <BG:inp.adresHerkomst xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:sub.correspondentieAdres>
                        <BG:typering xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.woonplaatsWaarinGelegen>
                            <BG:wpl.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                            <BG:wpl.woonplaatsNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        </BG:aoa.woonplaatsWaarinGelegen>
                        <BG:postcode xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:wpl.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:opr.identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:gor.openbareRuimteNaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:gor.straatnaam xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.huisnummer xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.huisletter xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aoa.huisnummertoevoeging xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    </BG:sub.correspondentieAdres>
                    <BG:sub.telefoonnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:sub.faxnummer xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:sub.emailadres xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:sub.url xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:sub.rekeningnummerBankGiro xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:acd.code xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:inp.burgerlijkeStaat xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.gemeenteVanInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.datumInschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:vbt.aanduidingVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.datumVerkrijgingVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.datumVerliesVerblijfstitel xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.datumVestigingInNederland xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.immigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.datumVertrekUitNederland xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.emigratieLand xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.signaleringReisdocument xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.aanduidingBijzonderNederlanderschap xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.buitenlandsReisdocument xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.aanduidingEuropeesKiesrecht xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.aanduidingUitgeslotenKiesrecht xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.indicatieGezagMinderjarige xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.indicatieCurateleRegister xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.datumOpschortingBijhouding xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.redenOpschortingBijhouding xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inp.indicatieGeheim xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:ing.indicatieBlokkering xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <BG:inOnderzoek groepsnaam="Persoonsgegevens" StUF:metagegeven="true" xsi:nil="true"
                                    StUF:noValue="waardeOnbekend"/>
                    <BG:inOnderzoek groepsnaam="Overlijden" StUF:metagegeven="true" xsi:nil="true"
                                    StUF:noValue="waardeOnbekend"/>
                    <BG:inOnderzoek elementnaam="aanduidingVerblijfstitel" StUF:metagegeven="true" xsi:nil="true"
                                    StUF:noValue="waardeOnbekend"/>
                    <BG:aanduidingStrijdigheidNietigheid StUF:metagegeven="true" xsi:nil="true"
                                                         StUF:noValue="waardeOnbekend"/>
                    <BG:brondocument StUF:metagegeven="true">
                        <BG:identificatie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:datum xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:omschrijving xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:gemeente xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <BG:aktegemeente xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    </BG:brondocument>
                    <StUF:tijdvakGeldigheid>
                        <StUF:beginGeldigheid xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:eindGeldigheid xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    </StUF:tijdvakGeldigheid>
                    <StUF:tijdstipRegistratie xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    <StUF:extraElementen>
                        <StUF:extraElement naam="CBR-nummer" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="aanduidingBijzonderNederlanderschapOmschrijving" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="aanduidingGegevensInOnderzoek" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="aanduidingGegevensInOnderzoekOverlijden" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="aanduidingGegevensInOnderzoekVerblijfstitel" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="aanduidingNaamgebruikOmschrijving" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="adellijkeTitelsoort" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="bic" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="codeGeboorteplaats" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="codePlaatsoverlijden" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="einddatumUitsluitingKiesrecht" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="geboortelandnaam" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="geboorteplaatsnaam" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="gemeentenaamInschrijving" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="handlichting" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="iban" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="indicatieOuderOntzetUitOuderlijkeMacht" xsi:nil="true"
                                           StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="landnaamEmigratie" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="landnaamImmigratie" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="landnaamOverlijden" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingAcademischeTitel" xsi:nil="true"
                                           StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="omschrijvingAdellijkeTitel" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingBurgerlijkeStaat" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingGeslachtsaanduiding">Vrouw</StUF:extraElement>
                        <StUF:extraElement naam="omschrijvingIndicatieCurateleregister" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingIndicatieGeheim" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingIndicatieGezagMinderjarige" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingIndicatieOuderOntzet" xsi:nil="true"
                                           StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="omschrijvingOnderToezichtstelling" xsi:nil="true"
                                           StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="omschrijvingPlaatsOverlijden" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingRedenOpschortingBijhoudingOmschrijving" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingUitsluitingKiesrecht" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="omschrijvingVerblijfstitel" xsi:nil="true"
                                           StUF:noValue="waardeOnbekend"/>
                        <StUF:extraElement naam="onderToezichtstelling" xsi:nil="true"
                                           StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="opgemaakteNaam">H. Repelsteeltje</StUF:extraElement>
                        <StUF:extraElement naam="rechtsvorm" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="terAttentieVan" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                        <StUF:extraElement naam="uitsluitingKiesrecht" xsi:nil="true" StUF:noValue="waardeOnbekend"/>
                    </StUF:extraElementen>
                    <BG:inp.heeftAlsEchtgenootPartner StUF:entiteittype="NPSNPSHUW" xsi:nil="true"
                                                      StUF:noValue="geenWaarde"/>
                    <BG:inp.heeftAlsKinderen StUF:entiteittype="NPSNPSKND" xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:inp.heeftAlsOuders StUF:entiteittype="NPSNPSOUD" xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:inp.heeftAlsNationaliteit StUF:entiteittype="NPSNAT" xsi:nil="true" StUF:noValue="geenWaarde"/>
                    <BG:ing.isHouderVan StUF:entiteittype="NPSRSDHDR" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                    <BG:ing.isBijgeschrevenOp StUF:entiteittype="NPSRSDBIJ" xsi:nil="true"
                                              StUF:noValue="waardeOnbekend"/>
                    <BG:rps.isEigenaarVan StUF:entiteittype="NPSMAC" xsi:nil="true" StUF:noValue="nietGeautoriseerd"/>
                </BG:object>
            </BG:antwoord>
        </BG:npsLa01>
    </soapenv:Body>
</soapenv:Envelope>
